#### GetEnumerator Method

---

|  |
| --- |
| MacroModule Class   See Also |

Returns an enumerator that iterates through a collection.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public virtual IEnumerator<Macro> GetEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function GetEnumerator As IEnumerator(Of Macro) ``` |

| Visual C++ |
| --- |
| ``` public: virtual IEnumerator<Macro^>^ GetEnumerator() ``` |

#### Return Value

An IEnumerator object that can be used to iterate through the collection.

#### Implements

 IEnumerable T GetEnumerator

# See Also

MacroModule Class

Autodesk.Revit.DB.Macros Namespace